###################################################################

# Created by write_sdc on Mon Sep 11 13:26:56 2023

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_area 0
create_clock -name vclk  -period 0.12  -waveform {0 0.06}
set_input_delay -clock vclk  0  [get_ports {data_in[63]}]
set_input_delay -clock vclk  0  [get_ports {data_in[62]}]
set_input_delay -clock vclk  0  [get_ports {data_in[61]}]
set_input_delay -clock vclk  0  [get_ports {data_in[60]}]
set_input_delay -clock vclk  0  [get_ports {data_in[59]}]
set_input_delay -clock vclk  0  [get_ports {data_in[58]}]
set_input_delay -clock vclk  0  [get_ports {data_in[57]}]
set_input_delay -clock vclk  0  [get_ports {data_in[56]}]
set_input_delay -clock vclk  0  [get_ports {data_in[55]}]
set_input_delay -clock vclk  0  [get_ports {data_in[54]}]
set_input_delay -clock vclk  0  [get_ports {data_in[53]}]
set_input_delay -clock vclk  0  [get_ports {data_in[52]}]
set_input_delay -clock vclk  0  [get_ports {data_in[51]}]
set_input_delay -clock vclk  0  [get_ports {data_in[50]}]
set_input_delay -clock vclk  0  [get_ports {data_in[49]}]
set_input_delay -clock vclk  0  [get_ports {data_in[48]}]
set_input_delay -clock vclk  0  [get_ports {data_in[47]}]
set_input_delay -clock vclk  0  [get_ports {data_in[46]}]
set_input_delay -clock vclk  0  [get_ports {data_in[45]}]
set_input_delay -clock vclk  0  [get_ports {data_in[44]}]
set_input_delay -clock vclk  0  [get_ports {data_in[43]}]
set_input_delay -clock vclk  0  [get_ports {data_in[42]}]
set_input_delay -clock vclk  0  [get_ports {data_in[41]}]
set_input_delay -clock vclk  0  [get_ports {data_in[40]}]
set_input_delay -clock vclk  0  [get_ports {data_in[39]}]
set_input_delay -clock vclk  0  [get_ports {data_in[38]}]
set_input_delay -clock vclk  0  [get_ports {data_in[37]}]
set_input_delay -clock vclk  0  [get_ports {data_in[36]}]
set_input_delay -clock vclk  0  [get_ports {data_in[35]}]
set_input_delay -clock vclk  0  [get_ports {data_in[34]}]
set_input_delay -clock vclk  0  [get_ports {data_in[33]}]
set_input_delay -clock vclk  0  [get_ports {data_in[32]}]
set_input_delay -clock vclk  0  [get_ports {data_in[31]}]
set_input_delay -clock vclk  0  [get_ports {data_in[30]}]
set_input_delay -clock vclk  0  [get_ports {data_in[29]}]
set_input_delay -clock vclk  0  [get_ports {data_in[28]}]
set_input_delay -clock vclk  0  [get_ports {data_in[27]}]
set_input_delay -clock vclk  0  [get_ports {data_in[26]}]
set_input_delay -clock vclk  0  [get_ports {data_in[25]}]
set_input_delay -clock vclk  0  [get_ports {data_in[24]}]
set_input_delay -clock vclk  0  [get_ports {data_in[23]}]
set_input_delay -clock vclk  0  [get_ports {data_in[22]}]
set_input_delay -clock vclk  0  [get_ports {data_in[21]}]
set_input_delay -clock vclk  0  [get_ports {data_in[20]}]
set_input_delay -clock vclk  0  [get_ports {data_in[19]}]
set_input_delay -clock vclk  0  [get_ports {data_in[18]}]
set_input_delay -clock vclk  0  [get_ports {data_in[17]}]
set_input_delay -clock vclk  0  [get_ports {data_in[16]}]
set_input_delay -clock vclk  0  [get_ports {data_in[15]}]
set_input_delay -clock vclk  0  [get_ports {data_in[14]}]
set_input_delay -clock vclk  0  [get_ports {data_in[13]}]
set_input_delay -clock vclk  0  [get_ports {data_in[12]}]
set_input_delay -clock vclk  0  [get_ports {data_in[11]}]
set_input_delay -clock vclk  0  [get_ports {data_in[10]}]
set_input_delay -clock vclk  0  [get_ports {data_in[9]}]
set_input_delay -clock vclk  0  [get_ports {data_in[8]}]
set_input_delay -clock vclk  0  [get_ports {data_in[7]}]
set_input_delay -clock vclk  0  [get_ports {data_in[6]}]
set_input_delay -clock vclk  0  [get_ports {data_in[5]}]
set_input_delay -clock vclk  0  [get_ports {data_in[4]}]
set_input_delay -clock vclk  0  [get_ports {data_in[3]}]
set_input_delay -clock vclk  0  [get_ports {data_in[2]}]
set_input_delay -clock vclk  0  [get_ports {data_in[1]}]
set_input_delay -clock vclk  0  [get_ports {data_in[0]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[79]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[78]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[77]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[76]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[75]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[74]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[73]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[72]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[71]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[70]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[69]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[68]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[67]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[66]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[65]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[64]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[63]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[62]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[61]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[60]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[59]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[58]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[57]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[56]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[55]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[54]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[53]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[52]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[51]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[50]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[49]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[48]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[47]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[46]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[45]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[44]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[43]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[42]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[41]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[40]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[39]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[38]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[37]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[36]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[35]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[34]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[33]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[32]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[31]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[30]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[29]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[28]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[27]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[26]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[25]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[24]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[23]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[22]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[21]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[20]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[19]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[18]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[17]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[16]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[15]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[14]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[13]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[12]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[11]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[10]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[9]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[8]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[7]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[6]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[5]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[4]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[3]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[2]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[1]}]
set_output_delay -clock vclk  0  [get_ports {codeword_out[0]}]
set_input_transition -max 0.1  [get_ports {data_in[63]}]
set_input_transition -min 0.1  [get_ports {data_in[63]}]
set_input_transition -max 0.1  [get_ports {data_in[62]}]
set_input_transition -min 0.1  [get_ports {data_in[62]}]
set_input_transition -max 0.1  [get_ports {data_in[61]}]
set_input_transition -min 0.1  [get_ports {data_in[61]}]
set_input_transition -max 0.1  [get_ports {data_in[60]}]
set_input_transition -min 0.1  [get_ports {data_in[60]}]
set_input_transition -max 0.1  [get_ports {data_in[59]}]
set_input_transition -min 0.1  [get_ports {data_in[59]}]
set_input_transition -max 0.1  [get_ports {data_in[58]}]
set_input_transition -min 0.1  [get_ports {data_in[58]}]
set_input_transition -max 0.1  [get_ports {data_in[57]}]
set_input_transition -min 0.1  [get_ports {data_in[57]}]
set_input_transition -max 0.1  [get_ports {data_in[56]}]
set_input_transition -min 0.1  [get_ports {data_in[56]}]
set_input_transition -max 0.1  [get_ports {data_in[55]}]
set_input_transition -min 0.1  [get_ports {data_in[55]}]
set_input_transition -max 0.1  [get_ports {data_in[54]}]
set_input_transition -min 0.1  [get_ports {data_in[54]}]
set_input_transition -max 0.1  [get_ports {data_in[53]}]
set_input_transition -min 0.1  [get_ports {data_in[53]}]
set_input_transition -max 0.1  [get_ports {data_in[52]}]
set_input_transition -min 0.1  [get_ports {data_in[52]}]
set_input_transition -max 0.1  [get_ports {data_in[51]}]
set_input_transition -min 0.1  [get_ports {data_in[51]}]
set_input_transition -max 0.1  [get_ports {data_in[50]}]
set_input_transition -min 0.1  [get_ports {data_in[50]}]
set_input_transition -max 0.1  [get_ports {data_in[49]}]
set_input_transition -min 0.1  [get_ports {data_in[49]}]
set_input_transition -max 0.1  [get_ports {data_in[48]}]
set_input_transition -min 0.1  [get_ports {data_in[48]}]
set_input_transition -max 0.1  [get_ports {data_in[47]}]
set_input_transition -min 0.1  [get_ports {data_in[47]}]
set_input_transition -max 0.1  [get_ports {data_in[46]}]
set_input_transition -min 0.1  [get_ports {data_in[46]}]
set_input_transition -max 0.1  [get_ports {data_in[45]}]
set_input_transition -min 0.1  [get_ports {data_in[45]}]
set_input_transition -max 0.1  [get_ports {data_in[44]}]
set_input_transition -min 0.1  [get_ports {data_in[44]}]
set_input_transition -max 0.1  [get_ports {data_in[43]}]
set_input_transition -min 0.1  [get_ports {data_in[43]}]
set_input_transition -max 0.1  [get_ports {data_in[42]}]
set_input_transition -min 0.1  [get_ports {data_in[42]}]
set_input_transition -max 0.1  [get_ports {data_in[41]}]
set_input_transition -min 0.1  [get_ports {data_in[41]}]
set_input_transition -max 0.1  [get_ports {data_in[40]}]
set_input_transition -min 0.1  [get_ports {data_in[40]}]
set_input_transition -max 0.1  [get_ports {data_in[39]}]
set_input_transition -min 0.1  [get_ports {data_in[39]}]
set_input_transition -max 0.1  [get_ports {data_in[38]}]
set_input_transition -min 0.1  [get_ports {data_in[38]}]
set_input_transition -max 0.1  [get_ports {data_in[37]}]
set_input_transition -min 0.1  [get_ports {data_in[37]}]
set_input_transition -max 0.1  [get_ports {data_in[36]}]
set_input_transition -min 0.1  [get_ports {data_in[36]}]
set_input_transition -max 0.1  [get_ports {data_in[35]}]
set_input_transition -min 0.1  [get_ports {data_in[35]}]
set_input_transition -max 0.1  [get_ports {data_in[34]}]
set_input_transition -min 0.1  [get_ports {data_in[34]}]
set_input_transition -max 0.1  [get_ports {data_in[33]}]
set_input_transition -min 0.1  [get_ports {data_in[33]}]
set_input_transition -max 0.1  [get_ports {data_in[32]}]
set_input_transition -min 0.1  [get_ports {data_in[32]}]
set_input_transition -max 0.1  [get_ports {data_in[31]}]
set_input_transition -min 0.1  [get_ports {data_in[31]}]
set_input_transition -max 0.1  [get_ports {data_in[30]}]
set_input_transition -min 0.1  [get_ports {data_in[30]}]
set_input_transition -max 0.1  [get_ports {data_in[29]}]
set_input_transition -min 0.1  [get_ports {data_in[29]}]
set_input_transition -max 0.1  [get_ports {data_in[28]}]
set_input_transition -min 0.1  [get_ports {data_in[28]}]
set_input_transition -max 0.1  [get_ports {data_in[27]}]
set_input_transition -min 0.1  [get_ports {data_in[27]}]
set_input_transition -max 0.1  [get_ports {data_in[26]}]
set_input_transition -min 0.1  [get_ports {data_in[26]}]
set_input_transition -max 0.1  [get_ports {data_in[25]}]
set_input_transition -min 0.1  [get_ports {data_in[25]}]
set_input_transition -max 0.1  [get_ports {data_in[24]}]
set_input_transition -min 0.1  [get_ports {data_in[24]}]
set_input_transition -max 0.1  [get_ports {data_in[23]}]
set_input_transition -min 0.1  [get_ports {data_in[23]}]
set_input_transition -max 0.1  [get_ports {data_in[22]}]
set_input_transition -min 0.1  [get_ports {data_in[22]}]
set_input_transition -max 0.1  [get_ports {data_in[21]}]
set_input_transition -min 0.1  [get_ports {data_in[21]}]
set_input_transition -max 0.1  [get_ports {data_in[20]}]
set_input_transition -min 0.1  [get_ports {data_in[20]}]
set_input_transition -max 0.1  [get_ports {data_in[19]}]
set_input_transition -min 0.1  [get_ports {data_in[19]}]
set_input_transition -max 0.1  [get_ports {data_in[18]}]
set_input_transition -min 0.1  [get_ports {data_in[18]}]
set_input_transition -max 0.1  [get_ports {data_in[17]}]
set_input_transition -min 0.1  [get_ports {data_in[17]}]
set_input_transition -max 0.1  [get_ports {data_in[16]}]
set_input_transition -min 0.1  [get_ports {data_in[16]}]
set_input_transition -max 0.1  [get_ports {data_in[15]}]
set_input_transition -min 0.1  [get_ports {data_in[15]}]
set_input_transition -max 0.1  [get_ports {data_in[14]}]
set_input_transition -min 0.1  [get_ports {data_in[14]}]
set_input_transition -max 0.1  [get_ports {data_in[13]}]
set_input_transition -min 0.1  [get_ports {data_in[13]}]
set_input_transition -max 0.1  [get_ports {data_in[12]}]
set_input_transition -min 0.1  [get_ports {data_in[12]}]
set_input_transition -max 0.1  [get_ports {data_in[11]}]
set_input_transition -min 0.1  [get_ports {data_in[11]}]
set_input_transition -max 0.1  [get_ports {data_in[10]}]
set_input_transition -min 0.1  [get_ports {data_in[10]}]
set_input_transition -max 0.1  [get_ports {data_in[9]}]
set_input_transition -min 0.1  [get_ports {data_in[9]}]
set_input_transition -max 0.1  [get_ports {data_in[8]}]
set_input_transition -min 0.1  [get_ports {data_in[8]}]
set_input_transition -max 0.1  [get_ports {data_in[7]}]
set_input_transition -min 0.1  [get_ports {data_in[7]}]
set_input_transition -max 0.1  [get_ports {data_in[6]}]
set_input_transition -min 0.1  [get_ports {data_in[6]}]
set_input_transition -max 0.1  [get_ports {data_in[5]}]
set_input_transition -min 0.1  [get_ports {data_in[5]}]
set_input_transition -max 0.1  [get_ports {data_in[4]}]
set_input_transition -min 0.1  [get_ports {data_in[4]}]
set_input_transition -max 0.1  [get_ports {data_in[3]}]
set_input_transition -min 0.1  [get_ports {data_in[3]}]
set_input_transition -max 0.1  [get_ports {data_in[2]}]
set_input_transition -min 0.1  [get_ports {data_in[2]}]
set_input_transition -max 0.1  [get_ports {data_in[1]}]
set_input_transition -min 0.1  [get_ports {data_in[1]}]
set_input_transition -max 0.1  [get_ports {data_in[0]}]
set_input_transition -min 0.1  [get_ports {data_in[0]}]
